## Pandas Tutorial

In [56]:
!pip install pandas

Requirement already satisfied: pandas in /home/johnny/anaconda3/lib/python3.7/site-packages (1.0.3)
Requirement already satisfied: python-dateutil>=2.6.1 in /home/johnny/anaconda3/lib/python3.7/site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.13.3 in /home/johnny/anaconda3/lib/python3.7/site-packages (from pandas) (1.18.2)
Requirement already satisfied: pytz>=2017.2 in /home/johnny/anaconda3/lib/python3.7/site-packages (from pandas) (2019.3)
Requirement already satisfied: six>=1.5 in /home/johnny/anaconda3/lib/python3.7/site-packages (from python-dateutil>=2.6.1->pandas) (1.14.0)

### DataFrame and Series

In [57]:
import pandas as pd
from pandas import DataFrame

In [58]:
data = {'x': [1, 2, 3, 4, 5], 'y': [1, 2, 3, 4, 5]}

In [59]:
data

{'x': [1, 2, 3, 4, 5], 'y': [1, 2, 3, 4, 5]}

In [60]:
type(data)

dict

## Create Pandas Dataframe from a python dict

In [61]:
df: DataFrame = pd.DataFrame(data)

In [62]:
df['x']

0    1
1    2
2    3
3    4
4    5
Name: x, dtype: int64

In [63]:
type(df['x'])

pandas.core.series.Series

In [64]:
df['y']

0    1
1    2
2    3
3    4
4    5
Name: y, dtype: int64

In [65]:
df.x

0    1
1    2
2    3
3    4
4    5
Name: x, dtype: int64

In [66]:
df.y

0    1
1    2
2    3
3    4
4    5
Name: y, dtype: int64

## Create Pandas Dataframe from CSV File

In [67]:
df: DataFrame = pd.read_csv('nba.csv')

In [68]:
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

## Create Pandas Dataframe using columns from other Dataframe

In [69]:
df: DataFrame = df[['Name', 'Team']]

In [70]:
df.head()

            Name            Team
0  Avery Bradley  Boston Celtics
1    Jae Crowder  Boston Celtics
2   John Holland  Boston Celtics
3    R.J. Hunter  Boston Celtics
4  Jonas Jerebko  Boston Celtics

## Create Pandas Dataframe using specific columns from CSV File

In [73]:
df: DataFrame = pd.read_csv('nba.csv', usecols=['Name', 'Age'])

In [74]:
df.head()

            Name   Age
0  Avery Bradley  25.0
1    Jae Crowder  25.0
2   John Holland  27.0
3    R.J. Hunter  22.0
4  Jonas Jerebko  29.0

## Define specific column as index

In [78]:
df.set_index('Name')

                Age
Name
Avery Bradley  25.0
Jae Crowder    25.0
John Holland   27.0
R.J. Hunter    22.0
Jonas Jerebko  29.0
...             ...
Shelvin Mack   26.0
Raul Neto      24.0
Tibor Pleiss   26.0
Jeff Withey    26.0
NaN             NaN

[458 rows x 1 columns]

## Save Pandas Dataframe to CSV File

In [79]:
df: DataFrame = pd.read_csv('nba.csv')

In [80]:
df.tail(4)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [81]:
df.to_csv('nba_new.csv')

## Dataframe Informations

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [83]:
df.describe()

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

In [84]:
df.shape

(458, 9)

In [85]:
df.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary'],
      dtype='object')

## Duplicated Rows on Dataframe

In [90]:
df.duplicated().sum()

0

In [91]:
df.duplicated(subset=['Team']).sum()

427

## Copy a Dataframe to another Dataframe

In [92]:
df: DataFrame = df.append(df)

In [93]:
df.duplicated().sum()

458

## Erase Duplicates row from a Dataframe

In [94]:
df.drop_duplicates()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [95]:
df.duplicated().sum()

458

## Rename Columns

In [98]:
df: DataFrame = pd.read_csv('nba.csv')

In [99]:
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [100]:
df.rename(columns={'Name': 'name', 'Team': 'team'})

,name,team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## If row contains null

In [134]:
df: DataFrame = pd.read_csv('IMDB-Movie-Data.csv')

In [135]:
df.isnull().sum()

Rank                    0
Title                   0
Genre                   0
Description             0
Director                0
Actors                  0
Year                    0
Runtime (Minutes)       0
Rating                  0
Votes                   0
Revenue (Millions)    128
Metascore              64
dtype: int64

In [136]:
df.shape

(1000, 12)

## If row constains not a number

In [137]:
df: DataFrame = pd.read_csv('IMDB-Movie-Data.csv')

In [138]:
df.isna().sum()

Rank                    0
Title                   0
Genre                   0
Description             0
Director                0
Actors                  0
Year                    0
Runtime (Minutes)       0
Rating                  0
Votes                   0
Revenue (Millions)    128
Metascore              64
dtype: int64

In [139]:
df.shape

(1000, 12)

## Drop rows which contain missing values

In [148]:
df: DataFrame = pd.read_csv('IMDB-Movie-Data.csv')

In [149]:
df.isna().sum()

Rank                    0
Title                   0
Genre                   0
Description             0
Director                0
Actors                  0
Year                    0
Runtime (Minutes)       0
Rating                  0
Votes                   0
Revenue (Millions)    128
Metascore              64
dtype: int64

In [150]:
df: DataFrame = df.dropna()

In [151]:
df.isna().sum()

Rank                  0
Title                 0
Genre                 0
Description           0
Director              0
Actors                0
Year                  0
Runtime (Minutes)     0
Rating                0
Votes                 0
Revenue (Millions)    0
Metascore             0
dtype: int64

In [152]:
df.shape

(838, 12)

## Drop columns which contain missing value.

In [153]:
df: DataFrame = pd.read_csv('IMDB-Movie-Data.csv')

In [154]:
df.isna().sum()

Rank                    0
Title                   0
Genre                   0
Description             0
Director                0
Actors                  0
Year                    0
Runtime (Minutes)       0
Rating                  0
Votes                   0
Revenue (Millions)    128
Metascore              64
dtype: int64

In [155]:
df = df.dropna(axis = 1)

In [156]:
df.isna().sum()

Rank                 0
Title                0
Genre                0
Description          0
Director             0
Actors               0
Year                 0
Runtime (Minutes)    0
Rating               0
Votes                0
dtype: int64

In [157]:
df.shape

(1000, 10)

## Fill null columns with default values

In [158]:
df: DataFrame = pd.read_csv('IMDB-Movie-Data.csv')

In [159]:
df.isnull().sum()

Rank                    0
Title                   0
Genre                   0
Description             0
Director                0
Actors                  0
Year                    0
Runtime (Minutes)       0
Rating                  0
Votes                   0
Revenue (Millions)    128
Metascore              64
dtype: int64

In [160]:
df = df.fillna(0)

In [161]:
df.isnull().sum()

Rank                  0
Title                 0
Genre                 0
Description           0
Director              0
Actors                0
Year                  0
Runtime (Minutes)     0
Rating                0
Votes                 0
Revenue (Millions)    0
Metascore             0
dtype: int64

## Fill null columns with mean values

In [165]:
df: DataFrame = pd.read_csv('IMDB-Movie-Data.csv')

In [166]:
df.isnull().sum()

Rank                    0
Title                   0
Genre                   0
Description             0
Director                0
Actors                  0
Year                    0
Runtime (Minutes)       0
Rating                  0
Votes                   0
Revenue (Millions)    128
Metascore              64
dtype: int64

In [167]:
df: DataFrame = df.fillna('mean')

In [168]:
df.isnull().sum()

Rank                  0
Title                 0
Genre                 0
Description           0
Director              0
Actors                0
Year                  0
Runtime (Minutes)     0
Rating                0
Votes                 0
Revenue (Millions)    0
Metascore             0
dtype: int64

## Using Lambda Function

In [201]:
x = lambda a: a*a

In [202]:
x(4)

16

In [203]:
df: DataFrame = pd.read_csv('IMDB-Movie-Data.csv')

In [204]:
df.isnull().sum()

Rank                    0
Title                   0
Genre                   0
Description             0
Director                0
Actors                  0
Year                    0
Runtime (Minutes)       0
Rating                  0
Votes                   0
Revenue (Millions)    128
Metascore              64
dtype: int64

In [205]:
mean_meta = df['Metascore'].mean()

In [206]:
mean_meta

58.98504273504273

In [207]:
df = df['Metascore'].apply(lambda x: x if x == x else mean_meta)

In [208]:
df.isnull().sum()

0

## Count specific values

In [209]:
df: DataFrame = pd.read_csv('IMDB-Movie-Data.csv')

In [211]:
df.tail(3)

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
997,998,Step Up 2: The Streets,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.01,50.0
998,999,Search Party,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
999,1000,Nine Lives,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

In [212]:
df['Genre'].value_counts()

Action,Adventure,Sci-Fi      50
Drama                        48
Comedy,Drama,Romance         35
Comedy                       32
Drama,Romance                31
                             ..
Comedy,Drama,Thriller         1
Comedy,Fantasy,Romance        1
Drama,Family                  1
Adventure,Fantasy,Mystery     1
Adventure,Biography           1
Name: Genre, Length: 207, dtype: int64